# 3) შექმენით სახელებით სავსე სია, ასევე შექმენით ცარიელი სია, თუ სიტყვის ყველა ასო არის პატარა, მაშინ ამ სიტყვის ყველა ასო 
# გახადეთ დიდი და შესაბამისი სიის ფუნქციის გამოყენებით ჩასვით ეს სიტყვა ცარიელი სიის დასაწყისში, ხოლო თუ სიტყვის ყველა 
# ასო არის დიდი, მაშინ ამ სიტყვის ყველა ასო გახადეთ პატარა და შესაბამისი სიის ფუნქციის გამოყენებით ჩასვით ეს სიტყვა 
# ცარიელი სიის ბოლოში. ბოლოს დაპრინტეთ მიღებული სია. გამოიყენეთ for ციკლი.

names = ["meryl", "JULIA", "AUDREY", "marilyn", "monica", "Nicole", "Gabrielle", "Anne", "Scarlett"]
new = []

for i in names:
    if i == i.lower():
        new.insert(0, i.upper())
    elif i == i.upper():  
        new.append(i.lower())
print(new)