# 9) შექმენით რიცხვებით სავსე სია, და დაპრინტეთ ახალი სია რომელშიც იქნება ყველა ინდექსამდე მდგომი რიცხვების ჯამი, მაგალითად: 
# თუ მოცემული გვაქვს სია nums = [1, 2, 3, 4], ახალ სიაში უნდა ჩავამტოთ 1 რადგან ჩვენი სია იწყება 1-ით, შემდეგ, ახალ სიაში 
# უნდა ჩავამატოთ 2 + 1 ანუ 3, შემდეგ სიაში უნდა ჩავამატოთ 3 + 2 + 1 ანუ 6, და ბოლოს უნდა ჩავამატოთ 4 + 3 + 2 + 1 
# ანუ 10, მივიღებთ სიას [1, 3, 6, 10].

nums = [1, 2, 3, 4]
new = []
sum = 0

for num in nums:
    sum += num
    new.append(sum)
print(new)
