# 3) მომხმარებელს შემოატანინეთ წინადადება რომელიც იწყება რამდენიმე სფეისით, ცარიელი ადგილებით, და ყოველ სიტყვებს შორის იყოს 
# ერთის მაგივრად რამდენიმე ცარიელი ადგილი, და წინადადება ასევე დამთავრდეს რამდენი სფეისით, მაგალითად: 
# "    I    love    Python    ". თქვენი დავალებაა რომ დაპრინტოთ მომხმარებლის მოცემული წინადადება 
# ჩვეულებრივი, ერთ-ერთი სფეისების გამოტოვებით, ამ შემთხვევაში ასე - "I love Python".

# sentence = input("enter some sentence (start with spaces and between words, write more than one spaces): ")
# spaces = 0
# space = " "


# for i in sentence:
#     if i >= space:
#         spaces += 1
        
# ??