# 6)მომხმარებელს შემოატანინე სახელი და რიცხვი(integer 0 იდან 6 ჩათვლით)
# შენი დავალებაა შექმნა სია მინიმუმ 6 ელემენტიანი
# insert() დახმარებით დაამატე სიაში მომხმარებლის მიერ შემოტანილი რიცხვი,მომხმარებლის მიერ შემოტანილ ინდექსზე
# მაგ:მომხმარებელმა სახელი შემოიტანა საბა და რიცხვი 4 , შენი დავალებაა რომ საბა დაამატო მეოთხე ინდექსზე
# (გამოიყენე ცვლადის სახელები იმიტომ რომ არ იცი მომხმარებელი რა მნშვნელობებს შემოიტანს
# დაბეჭდე სია რომ ნახო ჩაემატა თუ არა

name = input("enter name: ")
num = int(input("enter any number from 0 to 6: "))

list = [0, "saqartvelo", True, 1, "iberia", False, 0]
list.insert(num, name)

print(list)