# 3) შექმენით 2 სია, ერთში იყოს მხოლოდ სტრინგ ტიპის ელემენტები, ხოლო მეორე სავსე იყოს ინტიჯერი მონაცემთა ტიპის ელემენტებით, 
# რიცხვებით სავსე სიიდან, სტრინგებით სავსე სიაში ჩაამატე ის რიცხვები რომლებიც არიან 20-ზე მეტი და 50-ზე ნაკლები. 
# გამოიყენეთ for ციკლი და შესაფერისი სიის ფუნქცია.

nums = [10, 20, 26, 30, 36, 50, 60, 70]
words = ["music", "disco", "ball", "glitter", "gems", "stage", "artist", "DJ", "dance"]


for num in nums:
    if 20 < num < 50:     
        words.append(str(num))  

print(words)

