# 7)შექმენი ფუნქცია ერთი პარამეტრით — score.

# თუ ქულა ≥ 90 → დააბრუნოს "შესანიშნავი ქულა"

# თუ ქულა >= 70 და ნაკლებია ან <=89 → დააბრუნოს "კარგი ქულა"

# თუ ქულა >= 50 და <= 69 → დააბრუნოს "დამაკმაყოფილებელი ქულა"

# სხვა შემთხვევაში დააბრუნოს "ჩაჭრილი"

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

def exam(score):
    if score >= 90:
        return "შესანიშნავი ქულა!"
    elif score >= 70 and score <= 89:
        return "კარგი ქულა :)"
    else:
        return "ჩაჭრილი :("

print(exam(99))
print(exam(90))
print(exam(71))
print(exam(89))
print(exam(67))

