# 6) მომხმარებელს შემოატანინეთ წინადადება და ტერმინალში ყველა ახალ ხაზზე დაპრინტეთ ამ წინადადების სიტყვა და რიცხვი თუ 
# რამდენჯერ მეორდება ეს სიტყვა წანადადებაში. მაგალითად: თუ მოცემული გვაქვს წინადადება "Hello I love apples Hello", 
# მაშინ ტერმინალში ჯერ უნდა გამოვიდეს Hello 2, რადგან ეს სიტყვა 2-ჯერ მეორდება წინადადებაში, შემდეგ ხაზზე უნდა 
# ეწეროს I 1, შემდეგ love 1, და ბოლოს apples 1. გამოიყენეთ სიები, არ გამოიყენოთ count() ფუნქცია.

# sentence = input("enter sentence: ")
# new = []

# for i in sentence:
# ???