# 3) შექმენით რიცხვებით სავსე სია, თუ რიცხვი არის ლუწი ან დგას ლუწ ინდექსზე, ჩაამატეთ მისი კვადრატი ახალ სიაში - გამოიყენეთ 
# შესაბამისი მათემატიკური ოპერატორი, ხოლო თუ რიცხვი არის კენტი ან დგას კენტ ინდექსზე, ახალ სიაში ჩაამატეთ 2-ჯერ დიდი 
# რიცხვი. გამოიყენეთ while ციკლი.

nums = [2, 4, 3, 7, 6, 8, 9, 15, 2, 5, 2]
new = []

i = 0
while i < len(nums):
    if nums[i] % 2 == 0 or i % 2 == 0:
        new.append(nums[i] ** 2)
    elif nums[i] % 2 != 0 or i % 2 != 0:
        new.append(nums[i] * 2)
    i += 1
print(new)