# 6) შექმენით 2 სია, პირველ სიაში იყოს int მონაცემთა ტიპის ელემენტები, ხოლო მეორე სია სავსე იყოს string მონაცემთა ტიპის 
# ელემენტებით. For ციკლის საშუალებით, პირველი სიიდან remove() ფუნქციით ამოშალეთ ყოველი ლუწი რიცხვი რომლებიც 
# დგანან კენტ ინდექსზე, ხოლო მეორე სიიდან pop() ფუნქციით ამოშალეთ ყოველი ის სიტყვა რომელიც იწყება დიდი ასოთი 
# და დგას ლუწ ინდექსზე. ბოლოს შეაერთეთ ორივე შეცვლილი სიები ერთმანეთში, გახადეთ საერთო სია და დაპრინტეთ. 
# (კარგად დააკვირდით პირობას და არ იჩქაროთ. წარმატებები! ! !)


nums = [1, 2, 4, 5, 6, 7, 8, 9]
words = ["Music", "disco", "Ball", "glitter", "GEMS", "Stage", "artist", "DJ", "dance"]


for i in range(len(nums) - 1, -1, -1):
    if i % 2 == 1 and nums[i] % 2 == 0:
        nums.remove(nums[i])

for i in range(len(words) - 1, -1, -1):
    if i % 2 == 0 and words[i][0] == words[i][0].upper():
        words.pop(i)

# სიების გაერთიანება
result = nums + words

print(result)
