# 4) შექმენით არეული რიცხვებით სავსე გრძელი სია და 2 ცარიელი სია, ერთ სიაში ჩააგდეთ ყველა ის რიცხვი რომელიც არის ლუწი და დგას 
# კენტ ინდექსზე, ხოლო მეორე სიაში ჩააგდეთ ყველა ის რიცხვი რომელიც არის ლუწი და დგას კენტ ინდექსზე, გამოიყენეთ for ციკლი.

nums = [2, 5, 7, 8, 4, 36, 33, 21, 5, 1, 0]
even = []
odd = []

for i in range(len(nums)):
    if nums[i] % 2 == 0 and i % 2 != 0:
        even.append(nums[i])
    elif nums[i] % 2 != 0 and i % 2 == 0:
        odd.append(nums[i])
print(even)
print(odd)

